# KNN TITANIC

In [16]:
import pandas as pd

df_train = pd.read_csv("C:/Users/Clara/apps/iteso-data-analytics/data/raw/train (1).csv")
df_test = pd.read_csv("C:/Users/Clara/apps/\iteso-data-analytics/data/raw/test.csv")

<>:4: SyntaxWarning: invalid escape sequence '\i'
<>:4: SyntaxWarning: invalid escape sequence '\i'
C:\Users\Clara\AppData\Local\Temp\ipykernel_13836\2047362280.py:4: SyntaxWarning: invalid escape sequence '\i'
  df_test = pd.read_csv("C:/Users/Clara/apps/\iteso-data-analytics/data/raw/test.csv")

In [17]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
df_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [19]:
median_age = df_train["Age"].median()
df_train["Age"] = df_train["Age"].fillna(median_age)

In [20]:
mode_embarked = df_train["Embarked"].mode()[0]
df_train["Embarked"] =df_train["Embarked"].fillna(mode_embarked)

In [21]:
df_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [22]:
df_train['Sex'] = df_train['Sex'].replace({'male': 0, 'female': 1})

C:\Users\Clara\AppData\Local\Temp\ipykernel_13836\2320272599.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df_train['Sex'] = df_train['Sex'].replace({'male': 0, 'female': 1})

In [23]:
df_train = df_train.drop(['Name','Ticket','Cabin','Embarked'], axis=1)
df_train.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0            1         0       3    0  22.0      1      0   7.2500
1            2         1       1    1  38.0      1      0  71.2833
2            3         1       3    1  26.0      0      0   7.9250
3            4         1       1    1  35.0      1      0  53.1000
4            5         0       3    0  35.0      0      0   8.0500

In [24]:
df_train.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0            1         0       3    0  22.0      1      0   7.2500
1            2         1       1    1  38.0      1      0  71.2833
2            3         1       3    1  26.0      0      0   7.9250
3            4         1       1    1  35.0      1      0  53.1000
4            5         0       3    0  35.0      0      0   8.0500

In [25]:
from sklearn.neighbors import KNeighborsClassifier

clf = KNeighborsClassifier()

In [26]:
clf.fit(X, y)

NameError: name 'X' is not defined